name: "sentiment_bert"
platform: "onnxruntime_onnx"
max_batch_size: 16

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ 5 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

